app/views/companies/show.html.erb

SELECT "leads".* FROM "leads" INNER JOIN "company_leads" ON "leads"."id" = "company_leads"."lead_id" WHERE "company_leads"."company_id" = ?  [["company_id", 1]]
---
  <h4><%= @company.name%>'s Leads/Contacts</h4>
  <% @company.leads.each do |l| %>