app/controllers/companies_controller.rb

 def create
   @company = User.find(current_user.id).companies.build(company_params)
   if @company.save
---
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "companies" ("name", "revenue", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Yahoo"], ["revenue", 23], ["user_id", 1], ["created_at", "2017-08-22 21:34:31.519046"], ["updated_at", "2017-08-22 21:34:31.519046"]]

 def update
   if current_company
    @company.update(company_params)
---
UPDATE "companies" SET "customer" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["customer", "t"], ["updated_at", "2017-08-21 17:01:53.096241"], ["id", 1]]

 def destroy
   if current_company
    @company.delete
---
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 6]]