app/controllers/companies_controller.rb

 def update
   @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]