app/controllers/leads_controller.rb

INSERT INTO "leads" ("name", "created_at", "updated_at", "phone_number", "email") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["created_at", "2017-08-23 01:39:59.974330"], ["updated_at", "2017-08-23 01:39:59.974330"], ["phone_number", "12345678"], ["email", "email@hotmail.com"]]
---
  def create
    # binding.pry
    # @company = Company.find(params[:company_id])
    @lead= @company.leads.build
    @lead = Lead.new(lead_params)
    if @lead.save

UPDATE "leads" SET "contact" = ?, "updated_at" = ? WHERE "leads"."id" = ?  [["contact", "t"], ["updated_at", "2017-08-21 17:53:38.429677"], ["id", 2]]
---
  def update
    if current_lead.current_user
      @lead.update(lead_params)

DELETE FROM "leads" WHERE "leads"."id" = ?  [["id", 19]]
---
  def destroy
    if current_lead
      @lead.delete