app/controllers/leads_controller.rb

SELECT  "leads".* FROM "leads" WHERE "leads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @lead = Lead.find(params[:id])