app/controllers/leads_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def create
    @company = Company.find(params[:company_id])